0/nut
FoamFile
{
    format ascii;
    class volScalarField;
    location "0";
    object nut;
}

dimensions [0 2 -1 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inlet
    {
        type calculated;
        value uniform 0;
    }

    outlet
    {
        type calculated;
        value uniform 0;
    }

    top
    {
        type calculated;
        value uniform 0;
    }

    front
    {
        type symmetry;
    }

    back
    {
        type symmetry;
    }

    rocketAirbrake
    {
        type nutkWallFunction;
        value uniform 0;
    }

}