system/blockMeshDict
FoamFile
{
    format ascii;
    class dictionary;
    object blockMeshDict;
}

scale 1;

vertices
(
    (-20.00 -3.00 -18.00)
    ( 40.00 -3.00 -18.00)
    ( 40.00 20.00 -18.00)
    (-20.00 20.00 -18.00)

    (-20.00 -3.00  18.00)
    ( 40.00 -3.00  18.00)
    ( 40.00 20.00  18.00)
    (-20.00 20.00  18.00)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (120 46 72)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    background
    {
        type patch;

        faces
        (
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);